# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# Пример:
# 6 -> да
# 7 -> да
# 1 -> нет

number_day = int(input('Введите цифру дня недели - '))

if 1 <= number_day <= 5:
    print(number_day, '-> Ксожалению, это рабочий день ((((')
elif number_day == 6 or number_day == 7:
    print(number_day, ' -> Ура! это выходной день! ')
else:
    print(f'Дня недели под номером {number_day} не существует')