# Написать программу, которая будет ввыводит в консоль заданный текст (Python - один из самых популярных языков программирования в мире), затем принимать из консоли шаблон подстроки и удалять в задданом тексте все слова в которых присутствует введенный шаблон
# Пример:
# Python - один из самых популярных языков программирования в мире
# Введите подстроку: ам
# Python - один из популярных языков в мире

text = 'Python - один из самых популярных языков программирования в мире'
print(text)
podstroka = input('Введите подстроку: ')

words = text.split(' ')     # Преобразовываем текст в список

new_text = []  # Создаем новый список

for i in words:                # Заполняем новый список элементами из исходного списка, которые соответствуют условию
    if podstroka not in i:
        new_text.append(i)

print(' '.join(new_text))   # Переводим новый список в строку



