# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве
# (НЕОБЯЗАТЕЛЬНО, ПО ЖЕЛАНИЮ: найти растояние в 3D пространстве)
# Пример:
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21
import math

xA = int(input('Введите координату х точки А '))
yA = int(input('Введите координату y точки А '))
xB = int(input('Введите координату х точки B '))
yB = int(input('Введите координату y точки B '))

distans2D = math.sqrt(((xB - xA) ** 2) + ((yB - yA) ** 2))
print('Расстояние между точками А и В =  ', round(distans2D, 3))